import pymorphy2
import sys
import os

# Добавляем папку py в sys.path
sys.path.append(os.path.join(os.path.dirname(__file__), 'py'))

# Инициализируем объект для лемматизации
morph = pymorphy2.MorphAnalyzer()

# Символы, которые удаляем
symbols_to_remove = [
    ",", "/", "!", "?", "(", ")", "«", "»",
    "№", "+", "_", "=", "*", "&", "^", "%",
    "$", "@", "|", ":", ";", "\"", "'", "`", "~",
    "[", "]", "{", "}", "<", ">", "…", "–", "—",
    "‑", "‐"
]

# Стоп-слова (предлоги, союзы, частицы, наречия, которые не несут смысла)
stop_words = {
    "или", "но", "и", "в", "во", "не", "к",
    "до", "из", "от", "у", "о", "об", "обо", "про",
    "с", "со", "под", "над", "перед", "между",
    "через", "после", "внутри", "вне", "ради", "для",
    "при", "вокруг", "насчет", "вроде", "как", "ли",
    "даже", "тоже", "еще", "же", "ну", "то", "это",
    "этот", "так", "все", "весь", "он", "она", "они",
    "их", "его", "ее", "нам", "наш", "мне", "мой",
    "твой", "тебе", "тебя", "себя", "сам", "чтобы",
    "который", "тот", "там", "где", "зачем", "когда",
    "потому", "чем", "бы", "лишь", "если", "да",
    "нет", "ой", "ах", "ни", "около", "другие", "либо",
    "очень", "только", "больше", "меньше", "всегда",
    "куда", "откуда", "тогда", "поэтому", "также",
    "раз", "действительно", "дабы", "ведь", "будто",
    "кто", "чего", "кого", "ещё", "либо", "кое",
    "какой", "какая", "какое", "какие", "таков",
    "такова", "ой", "эх", "хм"
}


def LEGITIMAZE(extracted_text):
    """
    Преобразует текст в массив со словами в лемматизированной форме и убирает стоп-слова

    :param extracted_text: Исходный текст
    :return: Список очищенных слов в нормальной форме
    """
    # Убираем ненужные символы
    for symbol in symbols_to_remove:
        extracted_text = extracted_text.replace(symbol, "")

    # Разбиваем текст на слова
    words = extracted_text.split()

    # Лемматизируем слова и фильтруем
    res = []
    for word in words:
        lem_word = morph.parse(word)[0].normal_form  # Приводим в начальную форму
        if lem_word not in stop_words:  # Убираем стоп-слова
            res.append(lem_word)

    return res
